app/views/users/show.html.erb

SELECT "sports".* FROM "sports"
---
    <% if @ringer.img_url == "http://old.thebrokerlist.com/wp-content/uploads/2011/01/head-silhouette-with-question-mark.jpg"%>
    <div class="col-xs-3"><img height="50" src=<%= @ringer.img_url %>> <h4><small>Very original... :(</small></h4></div>
    <% else %>
    <div class="col-xs-3"><img height="50" src=<%= @ringer.img_url %>> <h4><small>Nice!!!</small></h4></div>
    <% end %>
  </div>

  <input type="hidden" class="form-control input-md" name="ringer_id" value=<%= @ringer.id %>>

  <div class="row-condensed">
    <div class="col-xs-3"><h4 class="text-right">Sports:</h4></div>
    <div class="col-xs-6">
      <div class="input-group"><div style="padding-top:10px; padding-left:2px">
          <% @sports.each do |s| %>
            <% if @sport_ids_for_this_ringer.index(s[:id]).present? %>
              <input name=<%= "sport[]" %> value=<%= s[:id] %> type="checkbox" checked> <%= s[:name] %>
            <% else %>
              <input name=<%= "sport[]" %> value=<%= s[:id] %> type="checkbox"> <%= s[:name] %>
            <% end %>
          <% end %>
        </div>
      </div>