app/controllers/admin_controller.rb

  def sports
      @sports = Array.new
      Sport.all.each do |sport|
        count = RingerSport.all.where(:sport_id => sport.id).count
---
SELECT "sports".* FROM "sports"
SELECT COUNT(*) FROM "ringer_sports" WHERE "ringer_sports"."sport_id" = 43