app/controllers/admin_controller.rb

  def display
      @sports = Array.new
      Sport.all.each do |sport|
        count = RingerSport.all.where(:sport_id => sport.id).count
        sport_hash = { :name => sport.name, :id => sport.id, :ringer_count => count}
        @sports.push(sport_hash)
      end


      @ringer_sport_pairs = Array.new
      Ringer.all.each do |r|
---
SELECT "sports".* FROM "sports"
SELECT COUNT(*) FROM "ringer_sports" WHERE "ringer_sports"."sport_id" = 52
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."ringer_id" = 41
SELECT "ringers".* FROM "ringers"

  def addsport
      newsport = Sport.new
      newsport.name = params[:sport_name]
      newsport.save
---
INSERT INTO "sports" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 16 Mar 2014 20:39:16 UTC +00:00], ["name", "Football"], ["updated_at", Sun, 16 Mar 2014 20:39:16 UTC +00:00]]

  def deletesport
      RingerSport.all.where(:sport_id => params[:sport_id]).each do |rs_to_delete|
        rs_to_delete.destroy
      end
      Sport.find_by(:id => params[:sport_id]).destroy
---
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."sport_id" = 43
DELETE FROM "sports" WHERE "sports"."id" = ?  [["id", 43]]
SELECT "sports".* FROM "sports" WHERE "sports"."id" = 43 LIMIT 1

  def deleteringer
    ringer_id = params[:ringer_id]
    ringer = Ringer.find_by(:id => ringer_id)

    user = User.find_by(:id => ringer.user_id)
    if user.present?
      user.has_ringer = false
      user.save
    end

    RingerSport.where(:ringer_id => ringer_id).each do |rs|
      rs.destroy
    end
    ringer.destroy
---
SELECT "ringers".* FROM "ringers" WHERE "ringers"."id" = 46 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 49 LIMIT 1
UPDATE "users" SET "has_ringer" = ?, "updated_at" = ? WHERE "users"."id" = 49  [["has_ringer", false], ["updated_at", Sun, 16 Mar 2014 23:14:55 UTC +00:00]]
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."ringer_id" = 46
DELETE FROM "ringers" WHERE "ringers"."id" = ?  [["id", 46]]