app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Other' LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."category_id" = 8 ORDER BY name asc
SELECT "items".* FROM "items" ORDER BY name asc
---
  def index
    if params[:cat].present?
      filter_category = Category.find_by(:name => params[:cat])
      @product_list = Item.all.where(:category_id => filter_category.id)
      @product_list = @product_list.order('name asc')

SELECT "items".* FROM "items" WHERE "items"."id" = 14 LIMIT 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."item_id" = 14 ORDER BY created_at desc
---
  def show
    @product = Item.find_by(:id => params[:product_id])
    @reviews = Review.where(:item_id => @product.id).order('created_at desc')

SELECT "items".* FROM "items" WHERE "items"."id" = 28 LIMIT 1
---
  def edit
    @product = Item.find_by(:id => params[:product_id])

SELECT "items".* FROM "items" WHERE "items"."id" = 25 LIMIT 1
UPDATE "items" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "items"."id" = 25  [["name", "Harry is not a Potter"], ["description", ""], ["updated_at", Fri, 28 Feb 2014 04:26:16 UTC +00:00]]
---
  def update
    product = Item.find_by(:id => params[:product_id])
    product.name = params["name"]
    product.price = params["price"]
    product.description = params["description"]
    product.image_url = params["image_url"]
    product.save