app/controllers/ringers_controller.rb

  def list
    if params[:sport].present?
      filter_sport = Sport.find_by(:name => params[:sport].gsub("-", " "))
      ringersport_list = RingerSport.all.where(:sport_id => filter_sport.id)
      @ringer_sport_pairs = Array.new
      ringersport_list.each do |ringersport|
          r = Ringer.find_by(:id => ringersport.ringer_id)
          s = Array.new
          rs_by_ringer = RingerSport.all.where(:ringer_id => r.id)
          rs_by_ringer.each do |rs|
            sport_name = Sport.find_by(:id => rs.sport_id).name
            s.push(sport_name)
          end
          rs_hash = { :ringer => r, :sports => s}
          @ringer_sport_pairs.push(rs_hash)
      end
      @ringer_sport_pairs = @ringer_sport_pairs.sort_by { |hash| hash[:ringer][:first] }
    else
      everyone = Ringer.all
---
SELECT "sports".* FROM "sports"
SELECT "sports".* FROM "sports" WHERE "sports"."name" = 'Flag' LIMIT 1
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."sport_id" = 1
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."ringer_id" = 34
SELECT "sports".* FROM "sports" WHERE "sports"."id" = 61 LIMIT 1
SELECT "ringers".* FROM "ringers" WHERE "ringers"."id" = 1 LIMIT 1
SELECT "ringers".* FROM "ringers"

  def show
    if params[:ringer_id].present?
      id = params[:ringer_id]
    else
      id = Ringer.first[:id]
    end
    r = Ringer.find_by(:id => id)
    s = Array.new
    ringersport_list = RingerSport.all.where(:ringer_id => r.id)
    ringersport_list.each do |rs|
---
SELECT "ringers".* FROM "ringers" ORDER BY "ringers"."id" ASC LIMIT 1
SELECT "ringers".* FROM "ringers" WHERE "ringers"."id" = 32 LIMIT 1
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."ringer_id" = 32
SELECT "sports".* FROM "sports" WHERE "sports"."id" = 57 LIMIT 1

  def create
    ringer = Ringer.new
    ringer.first = params[:first]
    ringer.last = params[:last]
    if params[:gender]=="Male"
      ringer.is_male = true
    else
      ringer.is_male = false
    end
    ringer.comp_level = params[:comp_level].to_i
    ringer.city = params[:city]
    ringer.state = params[:state]
    ringer.bio = params[:bio]

    user = User.find_by(:id => session[:user_id])
    ringer.user_id = user.id
    ringer.save
    user.has_ringer = true
    user.save

    params[:sport].each do |s|
      ringersport = RingerSport.new
      ringersport.ringer_id = Ringer.find_by(:user_id => session[:user_id]).id
      ringersport.sport_id = s
      ringersport.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
INSERT INTO "ringers" ("bio", "city", "comp_level", "created_at", "first", "is_male", "last", "state", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "has_ringer" = ?, "updated_at" = ? WHERE "users"."id" = 8  [["has_ringer", true], ["updated_at", Sun, 16 Mar 2014 02:35:02 UTC +00:00]]
SELECT "ringers".* FROM "ringers" WHERE "ringers"."user_id" = 6 LIMIT 1
INSERT INTO "ringer_sports" ("created_at", "ringer_id", "sport_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 16 Mar 2014 05:54:48 UTC +00:00], ["ringer_id", 4], ["sport_id", 1], ["updated_at", Sun, 16 Mar 2014 05:54:48 UTC +00:00]]

  def update
    ringer = Ringer.find_by(:id => params[:ringer_id])
    ringer.first = params[:first]
    ringer.last = params[:last]
    if params[:gender]=="Male"
      ringer.is_male = true
    else
      ringer.is_male = false
    end
    ringer.comp_level = params[:comp_level].to_i
    ringer.city = params[:city]
    ringer.state = params[:state]
    ringer.img_url = params[:img_url]
    ringer.bio = params[:bio]
    ringer.save

    ringer_id = Ringer.find_by(:user_id => session[:user_id]).id

    # Sync up the sports the user checked with what's in the DB

    #Destroy old RingerSport entries (we'll create new ones)
    RingerSport.where(:ringer_id => ringer_id).each do |rs|
      rs.destroy
    end

    # Create new RingerSport entries
    params[:sport].each do |s|
      ringersport = RingerSport.new
      ringersport.ringer_id = ringer_id
      ringersport.sport_id = s
      ringersport.save
---
SELECT "ringers".* FROM "ringers" WHERE "ringers"."id" = 5 LIMIT 1
UPDATE "ringers" SET "first" = ?, "last" = ?, "city" = ?, "state" = ?, "img_url" = ?, "bio" = ?, "updated_at" = ? WHERE "ringers"."id" = 5  [["first", "a"], ["last", "a"], ["city", "a"], ["state", "a"], ["img_url", "a"], ["bio", "a"], ["updated_at", Sun, 16 Mar 2014 04:46:13 UTC +00:00]]
SELECT "ringers".* FROM "ringers" WHERE "ringers"."user_id" = 6 LIMIT 1
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."ringer_id" = 4
INSERT INTO "ringer_sports" ("created_at", "ringer_id", "sport_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 16 Mar 2014 06:59:59 UTC +00:00], ["ringer_id", 6], ["sport_id", 2], ["updated_at", Sun, 16 Mar 2014 06:59:59 UTC +00:00]]

  def delete
    ringer_id = params[:ringer_id]
    ringer = Ringer.find_by(:id => ringer_id)

    user = User.find_by(:id => ringer.user_id)

    if user.present?
      user.has_ringer = false
      user.save
    end

    RingerSport.where(:ringer_id => ringer_id).each do |rs|
      rs.destroy
    end
    ringer.destroy
---
SELECT "ringers".* FROM "ringers" WHERE "ringers"."id" = 25 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 33 LIMIT 1
UPDATE "users" SET "has_ringer" = ?, "updated_at" = ? WHERE "users"."id" = 33  [["has_ringer", false], ["updated_at", Sun, 16 Mar 2014 18:06:01 UTC +00:00]]
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."ringer_id" = 25
DELETE FROM "ringers" WHERE "ringers"."id" = ?  [["id", 25]]