app/controllers/ringers_controller.rb

SELECT "sports".* FROM "sports" WHERE "sports"."name" = 'Soccer' LIMIT 1
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."sport_id" = 60
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."ringer_id" = 31
SELECT "sports".* FROM "sports" WHERE "sports"."id" = 55 LIMIT 1
SELECT "ringers".* FROM "ringers" WHERE "ringers"."id" IS NULL LIMIT 1
SELECT "ringers".* FROM "ringers"
---
  def index
    if params[:sport].present?
      filter_sport = Sport.find_by(:name => params[:sport])
      ringersport_list = RingerSport.all.where(:sport_id => filter_sport.id)
      @ringer_sport_pairs = Array.new
      ringersport_list.each do |ringersport|
          r = Ringer.find_by(:id => ringersport.ringer_id)
          s = Array.new
          rs_by_ringer = RingerSport.all.where(:ringer_id => r.id)
          rs_by_ringer.each do |rs|
            sport_name = Sport.find_by(:id => rs.sport_id).name
            s.push(sport_name)
          end
          rs_hash = { :ringer => r, :sports => s}
          @ringer_sport_pairs.push(rs_hash)
      end
      @ringer_sport_pairs = @ringer_sport_pairs.sort_by { |hash| hash[:ringer][:first] }
    else
      everyone = Ringer.all