app/controllers/sessions_controller.rb

  def create
    user = User.find_by(:username => params[:uname])
      if user.present?
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'madskillz' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."name" = 'Brian' LIMIT 1