app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."first_name" = 'Brian' LIMIT 1
---
  def create
    user = User.find_by(:first_name => params[:fname])