app/controllers/users_controller.rb

  def create
    user = User.new
    user.username = params[:uname]
    user.password = params[:pwd]
    user.has_ringer = false
    user.save
    user = User.find_by(:username => params[:uname])
---
INSERT INTO "users" ("created_at", "has_ringer", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 16 Mar 2014 02:09:53 UTC +00:00], ["has_ringer", false], ["password", "ryan"], ["updated_at", Sun, 16 Mar 2014 02:09:53 UTC +00:00], ["username", "Ryan2"]]
SELECT "users".* FROM "users" WHERE "users"."username" = 'ryan' LIMIT 1

  def show
    @user = User.find_by(:id => params[:user_id])
    if @user.id != session[:user_id]
      redirect_to root_url, notice: "Hacking attempt failed"
    end

    @sports = Array.new
    Sport.all.each do |sport|
      sport_hash = { :name => sport.name, :id => sport.id}
      @sports.push(sport_hash)
    end

    #Pulls in previous settings if already initialized
    if @user.has_ringer
      @ringer = Ringer.find_by(:user_id => @user.id)
      if @ringer.is_male
        @gender="Male"
      else
        @gender="Female"
      end

      @sport_ids_for_this_ringer = Array.new
      RingerSport.all.where(:ringer_id => @ringer.id).each do |ringersport|
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "sports".* FROM "sports"
SELECT "ringers".* FROM "ringers" WHERE "ringers"."user_id" = 3 LIMIT 1
SELECT "ringer_sports".* FROM "ringer_sports" WHERE "ringer_sports"."ringer_id" = 4

  def delete
    user = User.find_by(:id => session[:user_id])
    user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 33 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 33]]