app/views/products/show.html.erb

            </p>
            <p>by <%= User.find_by(:id => review.user_id).first_name %></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1

      <select name="user_id">
        <% User.all.each do |user| %>
---
SELECT "users".* FROM "users"